---
kind: method
id: M:Autodesk.Revit.DB.ExtensibleStorage.Field.Dispose
source: html/2d8c0933-ae95-2c73-5a80-6943e5ce92a2.htm
---
# Autodesk.Revit.DB.ExtensibleStorage.Field.Dispose Method

Releases all resources used by the Field

## Syntax (C#)
```csharp
public void Dispose()
```